# Напишите процедуру, которая принимает параметр – натуральное число N –
# и выводит на экран треугольник из * с катетами равными N.
# *
# **
# ***
# ****
# *****
# ******
# *******
# ********
# *********
# **********
n = int(input())
i = 1
z = '*'
while i !=n+1:
    print(z*i)
    i+=1

